local m = {
 [1] = {
  ["title"] = "Профориетация технологическая",
  ["praises"] = {
   ["long"] = {
    [1] = "У вас способности в математике, развивайте этот навык",
    [2] = "Вы начитанный человек, развивайте этот навык",
   },
   ["names"] = {
    [1] = "Технарь на",
    [2] = "Гуманитарий на",
   },
  },
  ["date"] = "03 мая, 2022",
  ["answers"] = {
   [1] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [2] = 2,
     },
     [2] = {
      [2] = 1,
     },
     [3] = {
      [1] = 2,
     },
     [4] = {
      [1] = 1,
     },
    },
   },
   [2] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [2] = 2,
     },
     [2] = {
      [2] = 1,
     },
     [3] = {
      [1] = 2,
     },
     [4] = {
      [1] = 1,
     },
    },
   },
   [3] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
     },
     [2] = {
      [1] = 1,
     },
     [3] = {
      [2] = 2,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [4] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [2] = 2,
     },
     [2] = {
      [2] = 1,
     },
     [3] = {
      [1] = 2,
     },
     [4] = {
      [1] = 1,
     },
    },
   },
   [5] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [2] = 2,
     },
     [2] = {
      [2] = 1,
     },
     [3] = {
      [1] = 2,
     },
     [4] = {
      [1] = 1,
     },
    },
   },
   [6] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
     },
     [2] = {
      [1] = 1,
     },
     [3] = {
      [2] = 2,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [7] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 5,
     },
     [2] = {
      [1] = 3,
     },
     [3] = {
      [2] = 0,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [8] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 4,
     },
     [2] = {
      [1] = 2,
     },
     [3] = {
      [2] = 0,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [9] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 4,
     },
     [2] = {
      [1] = 2,
     },
     [3] = {
      [2] = 0,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [10] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [2] = 4,
     },
     [2] = {
      [2] = 2,
     },
     [3] = {
      [2] = 1,
     },
     [4] = {
      [2] = 0,
     },
    },
   },
   [11] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
     },
     [2] = {
      [1] = 1,
     },
     [3] = {
      [2] = 1,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [12] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
     },
     [2] = {
      [1] = 1,
     },
     [3] = {
      [2] = 1,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [13] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
     },
     [2] = {
      [1] = 1,
     },
     [3] = {
      [2] = 1,
     },
     [4] = {
      [2] = 1,
     },
    },
   },
   [14] = {
    ["text"] = {
     [1] = "Совершенно верно",
     [2] = "Скорее верно",
     [3] = "Совершенно не верно",
     [4] = "Скорее неверно",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
     },
     [2] = {
      [1] = 1,
     },
     [3] = {
      [2] = 2,
     },
     [4] = {
      [2] = 4,
     },
    },
   },
  },
  ["id"] = "11",
  ["questions"] = {
   [1] = "Я предпочитаю доверять интуиции",
   [2] = "Я легко налаживаю контакты с другими людьми",
   [3] = "В споре я стремлюсь найти истину",
   [4] = "У меня хорошее образное мышление",
   [5] = "Я хороший оратор",
   [6] = "Я могу выполнять несколько задач одновременно",
   [7] = "Я отлично структурирую информацию",
   [8] = "У меня высокий уровень самоорганизации",
   [9] = "В любой задачи мне важен результат",
    
   [10] = "У меня преобладает абстрактное мышление",
   [11] = "Я стремлюсь во всем видеть логику",
   [12] = "Мне сложно работать в команде",
   [13] = "Я внимательный и усидчивый",
   [14] = "При принятии решений, я руководствуюсь разумом, а не чувствами",

   

  },
 },
 [2] = {
  ["title"] = "Профпригодность в условиях карантина",
  ["praises"] = {
   ["long"] = {
    [1] = "Вы отлично справитесь со своей работой",
    [2] = "Вам следует научиться пользоваться ПК",
    [3] = "Вау! Вы хороши во всём",
   },
   ["names"] = {
    [1] = "ГИБКОСТЬ",
    [2] = "НЕУСТОЧИВОСТЬ",
    [3] = "ЭФФЕКТИВНОСТЬ",
   },
  },
  ["date"] = "03 мая, 2022",
  ["answers"] = {
   [1] = {
    ["text"] = {
     [1] = "Да",
     [2] = "Конечно",
     [3] = "Нет",
     [4] = "Приемлемо",
    },
    ["balance"] = {
     [1] = {
      [1] = 1,
      [2] = 1,
     },
     [2] = {
      [1] = 2,
      [2] = 1,
     },
     [3] = {
      [1] = 1,
      [2] = 0,
     },
     [4] = {
      [1] = 1,
      [2] = 4,
     },
    },
   },
   [2] = {
    ["text"] = {
     [1] = "Уверенно",
     [2] = "Не уверенно",
     [3] = "Компьютер?",
     [4] = "Отлично",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
      [2] = 1,
     },
     [2] = {
      [1] = 3,
      [2] = 2,
     },
     [3] = {
      [1] = 3,
      [2] = 1,
     },
     [4] = {
      [1] = 1,
      [2] = 2,
     },
    },
   },
  },
  ["id"] = "12",
  ["questions"] = {
   [1] = "Вы согласны работать удалённо?",
   [2] = "Как работаете за компьютером?",
  },
 },
 [3] = {
  ["title"] = "Оценка сотрудника при найме",
  ["praises"] = {
   ["long"] = {
    [1] = "У вас способности в математике, развивайте этот навык",
    [2] = "Вы начитанный человек, развивайте этот навык",
    [3] = "Вау Вы хороши во всём",
   },
   ["names"] = {
    [1] = "ТЕХНАРЬ",
    [2] = "ГУМАНИТАРИЙ",
    [3] = "СМЕШАННЫЙ",
   },
  },
  ["date"] = "03 мая, 2022",
  ["answers"] = {
   [1] = {
    ["text"] = {
     [1] = "Люблю",
     [2] = "Нейтрально",
     [3] = "Нет",
     [4] = "Очень люблю",
    },
    ["balance"] = {
     [1] = {
      [1] = 1,
      [2] = 1,
     },
     [2] = {
      [1] = 2,
      [2] = 1,
     },
     [3] = {
      [1] = 1,
      [2] = 0,
     },
     [4] = {
      [1] = 1,
      [2] = 4,
     },
    },
   },
   [2] = {
    ["text"] = {
     [1] = "Да",
     [2] = "Часто",
     [3] = "Нет",
     [4] = "Что читаю?",
    },
    ["balance"] = {
     [1] = {
      [1] = 2,
      [2] = 1,
     },
     [2] = {
      [1] = 2,
      [2] = 2,
     },
     [3] = {
      [1] = 1,
      [2] = 1,
     },
     [4] = {
      [1] = 2,
      [2] = 0,
     },
    },
   },
  },
  ["id"] = "13",
  ["questions"] = {
   [1] = "Вы любите математику?",
   [2] = "Вы читаете стихи?",
  },
 },
}
--[[
Соотношение гуманитария и технаря в вас примерно равны, может и есть незначительные перевесы в какую-либо сторону. Вы будете комфортно себя чувствовать как среди гуманитариев, так и с технарями. Ведь вы понимаете особенности поведения, что одних, что других. Знаете как подобрать особый подход. С гуманитариями вы будете делать акцент на эмоциях, чувствах. Технарям предоставите логику и аргументы, без лишних эмоций
]]
local json = require"json"
for i=1, #m do
	m[i].questions = json.encode( m[i].questions )
	m[i].answers = json.encode( m[i].answers )
	m[i].praises = json.encode( m[i].praises )
end
return json.encode(m)