[{"id":"1","title":"Открытие конкурса для начинающий IT-специалистов","datePost":"3 May 2022","text":"«Цифровой прорыв» – крупнейшее командное соревнование в сфере информационных технологий, которое направлено на формирование и развитие команд, способных к созданию и внедрению прикладных цифровых продуктов в органах власти субъектов Российской Федерации, отечественных компаниях и предприятиях.\n\nВ связи с эпидемиологической ситуацией соревнования в этом году проходят онлайн. 7 июня были подведены итоги первого онлайн-хакатона.\n\nУчастники конкурса решали задачи от ведущих IT-компаний, стартапов и региональных ведомств, разработанные решения были представлены в прямом эфире. Победители разделили денежный приз в 1,5 миллиона рублей и получили поддержку партнеров конкурса."},{"id":"2","title":"Сбор на бесплатный вебинар! Обучение софт скиллам","datePost":"3 May 2022","text":"Hard skills — профессиональные навыки для выполнения конкретных рабочих задач. Soft skills — это надпрофессиональные навыки, которые помогают специалистам в любой отрасли быть востребованными и добиваться успеха в карьере.\n\nSoft skills позволяют эффективно и гармонично взаимодействовать с людьми, быстро адаптироваться к изменениям, мыслить вне шаблонов для успешного решения задач.\n\nФормат встречи — онлайн-конференция в Zoom. Вы сможете задать вопросы экспертам в прямом эфире. Узнаете, какие soft skills нужно развивать для вашего профессионального роста и какая из наших программ в этом поможет\n\n"},{"id":"3","title":"Открылся сайт центр занятости населения РС(Я)!","datePost":"3 May 2022","text":"Современный, просторный, светлый, а главное – удобный и многофункциональный. 3 мая открылся первый флагманский Центр занятости населения РС(Я). \n\nТеперь это не просто биржа труда, а место, где карьерные консультанты и эксперты помогают выстроить новую карьерную линию, определиться со стратегией обучения и найти работу по индивидуальному запросу соискателя.\n\nРаботодатели же в скором времени могут рассчитывать на подбор и подготовку кандидатов именно под свои требования. Для этого платформа разрабатывает специальные программы для корпоративных клиентов.\n"},{"id":"33","title":"Приложение обновлено!","datePost":"7 May 2022","text":"В 6 версии было добавлено:\n- Полный просмотр новостей\n- Просмотр доступных курсов\n- Дамп всех новостей в локальном тестировании\n- Добавлено переключения между главами видео\n- Фикс мелких багов\n"}]